ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    if (Cy_SysClk_IloIsEnabled()) /* No change in ILO configuration */
    {
        retStatus = CY_PRA_STATUS_SUCCESS;
    }
    else
    {
        if (!Cy_WDT_Locked())
        {
            Cy_SysClk_IloEnable();
            retStatus = CY_PRA_STATUS_SUCCESS;
        }
    }
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_IloDisable
****************************************************************************//**
*
* Disables ILO Clock
*
* \return
* CY_PRA_STATUS_SUCCESS when success
* CY_PRA_STATUS_ERROR_PROCESSING_ILO when failure
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_IloDisable(void)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_ERROR_PROCESSING_ILO;

    if (!Cy_SysClk_IloIsEnabled()) /* No change in ILO configuration */
    {
        retStatus = CY_PRA_STATUS_SUCCESS;
    }
    else
    {
        if (!Cy_WDT_Locked())
        {
            if (CY_SYSCLK_SUCCESS == Cy_SysClk_IloDisable())
            {
                retStatus = CY_PRA_STATUS_SUCCESS;
            }
        }
    }
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_IloHibernateOn
****************************************************************************//**
*
* Controls whether the ILO stays on during a hibernate, or through an XRES or
* brown-out detect (BOD) event.
*
* \param hibernateEnable
* true = ILO stays on during hibernate or across XRES/BOD. \n
* false = ILO turns off for hibernate or XRES/BOD.
*
* \return
* CY_PRA_STATUS_SUCCESS when success
* CY_PRA_STATUS_ERROR_PROCESSING_ILO when failure
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_IloHibernateOn(bool hibernateEnable)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_ERROR_PROCESSING_ILO;
    static bool hibernateOn = false; /* default hibernate state is false */

    if (hibernateOn == hibernateEnable) /* No change in ILO configuration */
    {
        retStatus = CY_PRA_STATUS_SUCCESS;
    }
    else
    {
        if (!Cy_WDT_Locked())
        {
            Cy_SysClk_IloHibernateOn(hibernateEnable);
            hibernateOn = hibernateEnable;
            retStatus = CY_PRA_STATUS_SUCCESS;
        }
    }
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ClkPumpInit
****************************************************************************//**
*
* Initializes PUMP Clock
*
* \param source \ref cy_en_clkpump_in_sources_t
* \param divider \ref cy_en_clkpump_divide_t
*
*******************************************************************************/
__STATIC_INLINE void Cy_PRA_ClkPumpInit(cy_en_clkpump_in_sources_t source, cy_en_clkpump_divide_t divider)
{
    Cy_SysClk_ClkPumpDisable();
    Cy_SysClk_ClkPumpSetSource(source);
    Cy_SysClk_ClkPumpSetDivider(divider);
    Cy_SysClk_ClkPumpEnable();
}


/*******************************************************************************
* Function Name: Cy_PRA_ClkTimerInit
****************************************************************************//**
*
* Initializes Timer Clock
*
* \param source \ref cy_en_clktimer_in_sources_t
* \param divider Divider value; valid range is 0 to 255. Divides the selected
* source (\ref Cy_SysClk_ClkTimerSetSource) by the (value + 1).
*
*******************************************************************************/
__STATIC_INLINE void Cy_PRA_ClkTimerInit(cy_en_clktimer_in_sources_t source, uint8_t divider)
{
    Cy_SysClk_ClkTimerDisable();
    Cy_SysClk_ClkTimerSetSource(source);
    Cy_SysClk_ClkTimerSetDivider(divider);
    Cy_SysClk_ClkTimerEnable();
}


/*******************************************************************************
* Function Name: Cy_PRA_PllInit
****************************************************************************//**
*
* Initializes Phase Locked Loop
*
* \param clkPath Selects which PLL to configure. 1 is the first PLL; 0 is invalid.
* \param pllConfig \ref cy_stc_pll_manual_config_t
*
* \return
* CY_PRA_STATUS_SUCCESS PLL init is success
* CY_PRA_STATUS_ERROR_PROCESSING PLL init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_PllInit(uint32_t clkPath, const cy_stc_pll_manual_config_t *pllConfig)
{
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_PllManualConfigure(clkPath, pllConfig))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING;
    }
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_PllEnable(clkPath, 10000u))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING;
    }

    return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_ClkHfInit
****************************************************************************//**
*
* Initializes High Frequency Clock
*
* \param clkHf selects which clkHf mux to configure.
* \param hfClkPath \ref cy_en_clkhf_in_sources_t
* \param divider \ref cy_en_clkhf_dividers_t
*
* \return
* CY_PRA_STATUS_SUCCESS CLK_HF init is success
* CY_PRA_STATUS_ERROR_PROCESSING CLK_HF init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_ClkHfInit( uint32_t clkHf, cy_en_clkhf_in_sources_t hfClkPath, cy_en_clkhf_dividers_t divider)
{
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_ClkHfSetSource(clkHf, hfClkPath))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING;
    }
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_ClkHfSetDivider(clkHf, divider))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING;
    }
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_ClkHfEnable(clkHf))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING;
    }

    return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_FllInit
****************************************************************************//**
*
* Initializes Frequency Locked Loop
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS FLL init is success
* CY_PRA_STATUS_ERROR_PROCESSING_FLL0 FLL init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_FllInit(const cy_stc_pra_system_config_t *devConfig)
{
    const cy_stc_fll_manual_config_t fllconfig =
    {
        .ccoRange = devConfig->fllCcoRange,
        .cco_Freq = devConfig->ccoFreq,
        .enableOutputDiv = devConfig->enableOutputDiv,
        .fllMult = devConfig->fllMult,
        .igain = devConfig->igain,
        .lockTolerance = devConfig->lockTolerance,
        .outputMode = devConfig->outputMode,
        .pgain = devConfig->pgain,
        .refDiv = devConfig->fllRefDiv,
        .settlingCount = devConfig->settlingCount,
    };

    if (CY_SYSCLK_SUCCESS != Cy_SysClk_FllManualConfigure(&fllconfig))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
    }
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_FllEnable(CY_PRA_FLL_ENABLE_TIMEOUT))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
    }

