ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_ExtClkInit
****************************************************************************//**
*
* Initializes External Clock Source
*
* \param devConfig
*
*******************************************************************************/
__STATIC_INLINE void Cy_PRA_ExtClkInit( const cy_stc_pra_system_config_t *devConfig )
{
    if (devConfig->extClkPort != NULL)
    {
        Cy_GPIO_Pin_FastInit(devConfig->extClkPort, devConfig->extClkPinNum, CY_GPIO_DM_HIGHZ, 0UL, devConfig->extClkHsiom);
    }
    Cy_SysClk_ExtClkSetFrequency(devConfig->extClkFreqHz);
}


/*******************************************************************************
* Function Name: Cy_PRA_EcoInit
****************************************************************************//**
*
* Initializes External Crystal Oscillator
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS CLK_ECO init is success
* CY_PRA_STATUS_ERROR_PROCESSING_ECO CLK_ECO init is failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_EcoInit(const cy_stc_pra_system_config_t *devConfig)
{
    if ((devConfig->ecoInPort != NULL) && (devConfig->ecoOutPort != NULL))
    {
        Cy_GPIO_Pin_FastInit(devConfig->ecoInPort, devConfig->ecoInPinNum, CY_GPIO_DM_ANALOG, 0UL, HSIOM_SEL_GPIO);
        Cy_GPIO_Pin_FastInit(devConfig->ecoOutPort, devConfig->ecoOutPinNum, CY_GPIO_DM_ANALOG, 0UL, HSIOM_SEL_GPIO);
    }
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_EcoConfigure(devConfig->ecoFreqHz, devConfig->ecoLoad, devConfig->ecoEsr, devConfig->ecoDriveLevel))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_ECO;
    }
    if (CY_SYSCLK_SUCCESS != Cy_SysClk_EcoEnable(CY_PRA_ECO_ENABLE_TIMEOUT))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_ECO;
    }

    return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_PiloInit
****************************************************************************//**
*
* Initializes PILO
*
*******************************************************************************/
__STATIC_INLINE void Cy_PRA_PiloInit(void)
{
    Cy_SysClk_PiloEnable();
}

#if defined(CY_IP_MXBLESS)
/*******************************************************************************
* Function Name: Cy_PRA_AltHfInit
****************************************************************************//**
*
* Initializes Alternative High-Frequency Clock
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS AltHF init is success
* CY_PRA_STATUS_ERROR_PROCESSING_ALTHF AltHF init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_AltHfInit(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_ble_eco_status_t status;
    status = Cy_BLE_EcoConfigure((cy_en_ble_eco_freq_t)devConfig->altHFfreq, (cy_en_ble_eco_sys_clk_div_t)devConfig->altHFsysClkDiv, devConfig->altHFcLoad, devConfig->altHFxtalStartUpTime, (cy_en_ble_eco_voltage_reg_t)devConfig->altHFvoltageReg);
    if ((CY_BLE_ECO_SUCCESS != status) && (CY_BLE_ECO_ALREADY_STARTED !=status))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_ALTHF;
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_AltHfReset
****************************************************************************//**
*
* Reset Alternative High-Frequency Clock
*
* \param devConfig
*
*******************************************************************************/
__STATIC_INLINE void Cy_PRA_AltHfReset(const cy_stc_pra_system_config_t *devConfig)
{
    static bool firstEntryAfterReset = true;

    /* Cy_BLE_EcoReset is called when this function is called firsttime
     * after Reset or ECO state changed from ENABLE to DISABLE at runtime */
    if (firstEntryAfterReset || (Cy_BLE_EcoIsEnabled() && !(devConfig->clkAltHfEnable)))
    {
        Cy_BLE_EcoReset();
        firstEntryAfterReset = false;
    }
}

#endif /* CY_IP_MXBLESS */


/*******************************************************************************
* Function Name: Cy_PRA_ClkLfInit
****************************************************************************//**
*
* Initializes Low-Frequency Clock
*
* \param clkLfSource \ref cy_en_clklf_in_sources_t
*
* \return
* CY_PRA_STATUS_SUCCESS LF init is success
* CY_PRA_STATUS_ERROR_PROCESSING_CLKLF LF init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_ClkLfInit(cy_en_clklf_in_sources_t clkLfSource)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_ERROR_PROCESSING_CLKLF;

    if (clkLfSource == Cy_SysClk_ClkLfGetSource()) /* No change in CLK_LF */
    {
        retStatus = CY_PRA_STATUS_SUCCESS;
    }
    else
    {
        if (!Cy_WDT_Locked())
        {
            Cy_SysClk_ClkLfSetSource(clkLfSource);
            retStatus = CY_PRA_STATUS_SUCCESS;
        }
    }
    return retStatus;
}


/*******************************************************************************
* Function Name: Cy_PRA_WcoInit
****************************************************************************//**
*
* Initializes Watch Crystal Oscillator
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS WCO init is success
* CY_PRA_STATUS_ERROR_PROCESSING_WCO WCO init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_WcoInit(const cy_stc_pra_system_config_t *devConfig)
{
    if ((devConfig->wcoInPort != NULL) && (devConfig->wcoOutPort != NULL))
    {
        Cy_GPIO_Pin_FastInit(devConfig->wcoInPort , devConfig->wcoInPinNum, 0x00U, 0x00U, HSIOM_SEL_GPIO);
        Cy_GPIO_Pin_FastInit(devConfig->wcoOutPort , devConfig->wcoOutPinNum, 0x00U, 0x00U, HSIOM_SEL_GPIO);
    }
    if (devConfig->bypassEnable)
    {
        Cy_SysClk_WcoBypass(CY_SYSCLK_WCO_BYPASSED);
    }
    else
    {
        Cy_SysClk_WcoBypass(CY_SYSCLK_WCO_NOT_BYPASSED);
    }

    if (CY_SYSCLK_SUCCESS != Cy_SysClk_WcoEnable(CY_PRA_WCO_ENABLE_TIMEOUT))
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_WCO;
    }

