ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_PowerInit
****************************************************************************//**
*
* Initializes Power
*
* \param devConfig
*
* \return
* CY_PRA_STATUS_SUCCESS Power init is success
* CY_PRA_STATUS_ERROR_PROCESSING_PWR Power init failed
*
*******************************************************************************/
__STATIC_INLINE cy_en_pra_status_t Cy_PRA_PowerInit(const cy_stc_pra_system_config_t *devConfig)
{
    static bool firstCallAfterReset = true;
    cy_en_pra_status_t status;

    /* Reset the Backup domain on POR, XRES, BOD only if Backup domain is supplied by VDDD */
    if ((devConfig->vBackupVDDDEnable) && firstCallAfterReset)
    {
        if (devConfig->iloEnable)
        {
            if (0u == Cy_SysLib_GetResetReason() /* POR, XRES, or BOD */)
            {
                if (CY_SYSLIB_SUCCESS != Cy_SysLib_ResetBackupDomain())
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
                }
                status = Cy_PRA_IloDisable();
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return status;
                }
                status = Cy_PRA_IloEnable();
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return status;
                }
                status = Cy_PRA_IloHibernateOn(devConfig->iloHibernateON);
                if (CY_PRA_STATUS_SUCCESS != status)
                {
                    return status;
                }
            }
        }
    }
    firstCallAfterReset = false;

    if (devConfig->ldoEnable)
    {
        /* LDO valid voltage */
        if ((devConfig->ldoVoltage == CY_SYSPM_LDO_VOLTAGE_0_9V) ||
            (devConfig->ldoVoltage == CY_SYSPM_LDO_VOLTAGE_1_1V))
            {
                if (CY_SYSPM_SUCCESS != Cy_SysPm_LdoSetVoltage(devConfig->ldoVoltage))
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
                }
            }
    }
    else
    {
        if ((devConfig->buckVoltage == CY_SYSPM_BUCK_OUT1_VOLTAGE_0_9V) ||
            (devConfig->buckVoltage == CY_SYSPM_BUCK_OUT1_VOLTAGE_1_1V))
            {
                if (CY_SYSPM_SUCCESS != Cy_SysPm_BuckEnable(devConfig->buckVoltage))
                {
                    return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
                }
            }
    }

    if (devConfig->pwrCurrentModeMin)
    {
        /* Sets the system into minimum core regulator current mode */
        if (CY_SYSPM_SUCCESS != Cy_SysPm_SystemSetMinRegulatorCurrent())
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
        }
    }
    else
    {
        /* Sets the system into normal core regulator current mode */
        if (CY_SYSPM_SUCCESS != Cy_SysPm_SystemSetNormalRegulatorCurrent())
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PWR;
        }
    }

    /* Configure PMIC */
    Cy_SysPm_UnlockPmic();
    if (devConfig->pmicEnable)
    {
        Cy_SysPm_PmicEnableOutput();
    }
    else
    {
        Cy_SysPm_PmicDisableOutput();
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetInputPathMuxFrq
****************************************************************************//**
*
* Get Source clock frequency for the PATH MUX
*
* \param pathMuxSrc Source clock for the PATH_MUX
* \param devConfig System Configuration Parameter
*
* \return
* Returns source frequency of path mux
*
*******************************************************************************/
static uint32_t Cy_PRA_GetInputPathMuxFrq(cy_en_clkpath_in_sources_t pathMuxSrc, const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY; /* Hz */

    switch (pathMuxSrc)
    {
        case CY_SYSCLK_CLKPATH_IN_IMO:
        {
            srcFreq = CY_PRA_IMO_SRC_FREQUENCY; /* IMO Freq = 8 MHz */
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_EXT:
        {
            srcFreq = devConfig->extClkFreqHz;
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ECO:
        {
            srcFreq = devConfig->ecoFreqHz;
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ALTHF:
        {
            srcFreq = devConfig->altHFfreq;
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ILO:
        {
            srcFreq = CY_PRA_ILO_SRC_FREQUENCY; /* ILO Freq = 32 KHz */
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_WCO:
        {
            srcFreq = CY_PRA_WCO_SRC_FREQUENCY; /* WCO Freq = 32.768 KHz */
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_PILO:
        {
            if(CY_SRSS_PILO_PRESENT)
            {
                srcFreq = CY_PRA_PILO_SRC_FREQUENCY; /* PILO Freq = 32.768 KHz */
            }
        }
        break;
        default:
        {
            srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;
        }
        break;
    } /* End Switch */

    return srcFreq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetInputSourceFreq
****************************************************************************//**
*
* Get Source clock frequency for the Clock Path. This function is called from HF
* level
*
* \param clkPath Clock Path
* \param devConfig System Configuration Parameter
* \param srcFreq is source frequency of clock path that is updated in this function.
*
* \return
* CY_PRA_STATUS_SUCCESS if frequency is updated.
* CY_PRA_STATUS_INVALID_PARAM if the clkpaht is not valid path.
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_GetInputSourceFreq(uint32_t clkPath, const cy_stc_pra_system_config_t *devConfig, uint32_t *srcFreq )
{
    cy_en_pra_status_t status = CY_PRA_STATUS_INVALID_PARAM;
    *srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;

    if(clkPath >= CY_SRSS_NUM_CLKPATH)
    {
        return status;
    }

    switch (clkPath)
    {
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH0: /* CLK_PATH0 */
        {
            if (devConfig->path0Enable)
            {
                /* check for FLL */
                if ((devConfig->fllEnable) && (devConfig->outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT))
                {
                    *srcFreq = devConfig->fllOutFreqHz;
                    status = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path0Src, devConfig);
                    status = CY_PRA_STATUS_SUCCESS;
                }
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH1: /* CLK_PATH1 */
        {
            if (devConfig->path1Enable)
            {
                /* check for PLL0 */
                if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (devConfig->pll0Enable) && (devConfig->pll0OutputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT))
                {
                    *srcFreq = devConfig->pll0OutFreqHz;
                    status = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path1Src, devConfig);
                    status = CY_PRA_STATUS_SUCCESS;
                }
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH2: /* CLK_PATH2 */
        {
            if (devConfig->path2Enable)
            {
                /* check for PLL1 */
                if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (devConfig->pll1Enable) && (devConfig->pll1OutputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT))
                {
                    *srcFreq = devConfig->pll1OutFreqHz;
                    status = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path2Src, devConfig);
                    status = CY_PRA_STATUS_SUCCESS;
                }
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH3: /* CLK_PATH3 */
        {
            if (devConfig->path3Enable)
            {
                *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path3Src, devConfig);
                status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH4: /* CLK_PATH4 */
        {
            if (devConfig->path4Enable)
            {
                *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path4Src, devConfig);
                status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH5: /* CLK_PATH5 */
        {
            if (devConfig->path5Enable)
            {
                *srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path5Src, devConfig);
                status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        default:
        {
            *srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;
        }
        break;
    }

