ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_PRA_GetClkLfFreq
****************************************************************************//**
*
* Get Low-Frequency Clock (CLK_LF)
*
* \param devConfig System Configuration Parameter
*
* \return CLK_LF frequency
*
*******************************************************************************/
static uint32_t Cy_PRA_GetClkLfFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq = CY_PRA_DEFAULT_SRC_FREQUENCY;

    if (devConfig->clkLFEnable)
    {
        switch (devConfig->clkLfSource)
        {
            case CY_SYSCLK_CLKLF_IN_ILO:
            {
                if (devConfig->iloEnable)
                {
                    freq = CY_PRA_ILO_SRC_FREQUENCY;
                }
            }
            break;
            case CY_SYSCLK_CLKLF_IN_WCO:
            {
                if (devConfig->wcoEnable)
                {
                    freq = CY_PRA_WCO_SRC_FREQUENCY;
                }
            }
            break;
            case CY_SYSCLK_CLKLF_IN_PILO:
            {
                if ((devConfig->piloEnable) && (CY_SRSS_PILO_PRESENT))
                {
                    freq = CY_PRA_PILO_SRC_FREQUENCY;
                }
            }
            break;
            default:
            {
                freq = CY_PRA_DEFAULT_SRC_FREQUENCY;
            }
            break;
        } /* End Switch */
    }

    return freq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetClkBakFreq
****************************************************************************//**
*
* Get BAK Clock (CLK_BAK) frequency
*
* \param devConfig System Configuration Parameter
*
* \return CLK_LF frequency
*
*******************************************************************************/
static uint32_t Cy_PRA_GetClkBakFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq = CY_PRA_DEFAULT_SRC_FREQUENCY;

    if (devConfig->clkBakEnable)
    {
        switch (devConfig->clkBakSource)
        {
            case CY_SYSCLK_BAK_IN_WCO:
            {
                if (devConfig->wcoEnable)
                {
                    freq = CY_PRA_WCO_SRC_FREQUENCY;
                }
            }
            break;
            case CY_SYSCLK_BAK_IN_CLKLF:
            {
                if (devConfig->clkLFEnable)
                {
                    freq = Cy_PRA_GetClkLfFreq(devConfig);
                }
            }
            break;
            default:
            {
                freq = CY_PRA_DEFAULT_SRC_FREQUENCY;
            }
            break;
        } /* End Switch */
    }

    return freq;
}


/*******************************************************************************
* Function Name: Cy_PRA_GetClkTimerFreq
****************************************************************************//**
*
* Get CLK_TIMER output frequency
*
* \param devConfig System Configuration Parameter
*
* \return CLK_TIME output frequency
*
*******************************************************************************/
static uint32_t Cy_PRA_GetClkTimerFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq = CY_PRA_DEFAULT_SRC_FREQUENCY;
    uint8_t srcDiv;
    cy_en_pra_status_t status = CY_PRA_STATUS_SUCCESS;

    /* source clock must be enabled */
    if (devConfig->clkTimerEnable)
    {
        switch (devConfig->clkTimerSource)
        {
            case CY_SYSCLK_CLKTIMER_IN_IMO:
            {
                /* IMO is always on */
                freq = CY_PRA_IMO_SRC_FREQUENCY; /* 8 MHz */
                srcDiv = CY_PRA_DIVIDER_1;
            }
            break;
            case CY_SYSCLK_CLKTIMER_IN_HF0_NODIV:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV2:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV4:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV8:
            {
                if ( devConfig->clkHF0Enable )
                {
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV2)
                    {
                        srcDiv = CY_PRA_DIVIDER_2;
                    }
                    else if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV4)
                    {
                        srcDiv = CY_PRA_DIVIDER_4;
                    }
                    else if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV8)
                    {
                        srcDiv = CY_PRA_DIVIDER_8;
                    }
                    else
                    {
                        srcDiv = CY_PRA_DIVIDER_1;
                    }
                    freq = devConfig->hf0OutFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION;
                }
                else
                {
                    status = CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
                }
            }
            break;
            default:
            {
                freq = CY_PRA_DEFAULT_SRC_FREQUENCY;
                status = CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
            }
            break;
        }

        if (status != CY_PRA_STATUS_INVALID_PARAM_CLKTIMER)
        {
            freq = (freq / (devConfig->clkTimerDivider + 1UL)) / srcDiv;
        }
    }

    return freq;
}

/*******************************************************************************
* Function Name: Cy_PRA_GetInputSourceClock
****************************************************************************//**
*
* Get Source clock for the Clock Path
*
* \param clkPath Clock Path
* \param devConfig System Configuration Parameter
*
* \return
* Returns source clock
*
*******************************************************************************/
static cy_en_clkpath_in_sources_t Cy_PRA_GetInputSourceClock(uint32_t clkPath, const cy_stc_pra_system_config_t *devConfig, cy_en_pra_status_t *status)
{
    cy_en_clkpath_in_sources_t srcClock = CY_SYSCLK_CLKPATH_IN_IMO;

    if(clkPath >= CY_SRSS_NUM_CLKPATH)
    {
        *status = CY_PRA_STATUS_INVALID_PARAM;
        return srcClock;
    }

    *status = CY_PRA_STATUS_INVALID_PARAM;

    switch (clkPath)
    {
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH0: /* CLK_PATH0 */
        {
            if (devConfig->path0Enable)
            {
                srcClock = devConfig->path0Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH1: /* CLK_PATH1 */
        {
            if (devConfig->path1Enable)
            {
                srcClock = devConfig->path1Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH2: /* CLK_PATH2 */
        {
            if (devConfig->path2Enable)
            {
                srcClock = devConfig->path2Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH3: /* CLK_PATH3 */
        {
            if (devConfig->path3Enable)
            {
                srcClock = devConfig->path3Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH4: /* CLK_PATH4 */
        {
            if (devConfig->path4Enable)
            {
                srcClock = devConfig->path4Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH5: /* CLK_PATH5 */
        {
            if (devConfig->path5Enable)
            {
                srcClock = devConfig->path5Src;
                *status = CY_PRA_STATUS_SUCCESS;
            }
        }
        break;
        default:
        {
            /* Return CY_PRA_STATUS_INVALID_PARAM */
        }
        break;
    }

