ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return srcClock;
}

#define CY_PRA_SYSCLK_ECO_FREQ_MIN (16000000UL) /* 16 MHz   */
#define CY_PRA_SYSCLK_ECO_FREQ_MAX (35000000UL) /* 35 MHz   */
#define CY_PRA_SYSCLK_ECO_CSM_MIN  (1UL)        /* 1  pF    */
#define CY_PRA_SYSCLK_ECO_CSM_MAX  (100UL)      /* 100 pF   */
#define CY_PRA_SYSCLK_ECO_ESR_MIN  (1UL)        /* 1  Ohm   */
#define CY_PRA_SYSCLK_ECO_ESR_MAX  (1000UL)     /* 1000 Ohm */
#define CY_PRA_SYSCLK_ECO_DRV_MIN  (1UL)        /* 1 kW     */
#define CY_PRA_SYSCLK_ECO_DRV_MAX  (1000UL)     /* 1 mW     */


/*******************************************************************************
* Function Name: Cy_PRA_ValidateECO
****************************************************************************//**
*
* Validate ECO
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_ECO for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateECO(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;

    /* ECO can't be source for HF0. This check will be performed in HF0 validation  */
    /* Parameter validation will be implemented in DRIVERS-2751 */
    if ((CY_SYSCLK_ECOSTAT_STABLE != Cy_SysClk_EcoGetStatus()) && (devConfig->ecoEnable))
    {
        if (((devConfig->ecoFreqHz >= CY_PRA_SYSCLK_ECO_FREQ_MIN) && (devConfig->ecoFreqHz <= CY_PRA_SYSCLK_ECO_FREQ_MAX)) /* legal range of ECO frequecy is [16.0000-35.0000] */
            && ((devConfig->ecoLoad >= CY_PRA_SYSCLK_ECO_CSM_MIN) && (devConfig->ecoLoad <= CY_PRA_SYSCLK_ECO_CSM_MAX)) /* ECO cLoad range [1 - 100] */
            && ((devConfig->ecoEsr >= CY_PRA_SYSCLK_ECO_ESR_MIN) && (devConfig->ecoEsr <= CY_PRA_SYSCLK_ECO_ESR_MAX)) /* ECO ESR range [1 - 1000] */
            && ((devConfig->ecoDriveLevel >= CY_PRA_SYSCLK_ECO_DRV_MIN) && (devConfig->ecoDriveLevel <= CY_PRA_SYSCLK_ECO_DRV_MAX))) /* ECO Drive Level range [1 - 1000] */
        {
            retStatus = CY_PRA_STATUS_SUCCESS;
        }
        else
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_ECO;
        }
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateEXTClk
****************************************************************************//**
*
* Validate External Clock Source
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_EXTCLK for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateEXTClk(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t maxFreq;

    /* For ULP mode, Fextclk_max = 50 MHz. For LP mode, Fextclk_max = 100 MHz or Fcpu_max (if Fcpu_max < 100 MHz) */
    if (devConfig->extClkEnable)
    {
        if (devConfig->ulpEnable)
        {
            if (devConfig->extClkFreqHz > CY_PRA_ULP_MODE_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_EXTCLK;
            }
        }
        else
        {
            (CY_HF_CLK_MAX_FREQ > CY_PRA_LP_MODE_MAX_FREQUENCY) ? (maxFreq = CY_PRA_LP_MODE_MAX_FREQUENCY) : (maxFreq = CY_HF_CLK_MAX_FREQ);
            if (devConfig->extClkFreqHz > maxFreq)
            {
                return CY_PRA_STATUS_INVALID_PARAM_EXTCLK;
            }
        } /*usingULP*/

        /* GPIO port can't be NULL */
        if (devConfig->extClkPort == NULL)
        {
            return CY_PRA_STATUS_INVALID_PARAM_EXTCLK;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

#if defined(CY_IP_MXBLESS)

/*******************************************************************************
* Function Name: Cy_PRA_ValidateAltHf
****************************************************************************//**
*
* Validate Alternative High-Frequency Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_ALTHF for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateAltHf(const cy_stc_pra_system_config_t *devConfig)
{

    if (devConfig->clkAltHfEnable)
    {
        uint32_t startupTime;
        /* Validate Frequency */
        if ((devConfig->altHFfreq < CY_PRA_ALTHF_MIN_FREQUENCY) || (devConfig->altHFfreq > CY_PRA_ALTHF_MAX_FREQUENCY))
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
        /* Startup Time */
        startupTime = devConfig->altHFxtalStartUpTime << 5U;
        if ((startupTime < CY_PRA_ALTHF_MIN_STARTUP_TIME) || (startupTime > CY_PRA_ALTHF_MAX_STARTUP_TIME))
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
        /* Load Cap Range min="7.5" max="26.325" */
        if ((devConfig->altHFcLoad < CY_PRA_ALTHF_MIN_LOAD) || (devConfig->altHFcLoad > CY_PRA_ALTHF_MAX_LOAD))
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
        /* Validate clock divider */
        if (devConfig->altHFsysClkDiv > CY_BLE_SYS_ECO_CLK_DIV_8)
        {
            return CY_PRA_STATUS_INVALID_PARAM_ALTHF;
        }
    }
    return CY_PRA_STATUS_SUCCESS;
}
#endif /* CY_IP_MXBLESS */

/*******************************************************************************
* Function Name: Cy_PRA_ValidateFLL
****************************************************************************//**
*
* Validate Frequency Locked Loop (FLL)
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_FLL for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateFLL(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq;

