ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    if ((!Cy_SysClk_FllIsEnabled()) && (devConfig->fllEnable))
    {
        /* FLL is always sourced from PATH_MUX0 */
        /* If FLL is sourced from ECO, WCO, ALTHF, EXTCLK, ILO, PILO clocks, then FLL output can't source
         * to HF0. This check is performed at HF0 validation */
        if (devConfig->path0Enable)
        {
            /* Source clock for FLL valid range is 1 kHz - 100 MHz */
            srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path0Src, devConfig);
            if ((srcFreq < CY_PRA_FLL_SRC_MIN_FREQUENCY) || (srcFreq > CY_PRA_FLL_SRC_MAX_FREQUENCY))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }

            /* For ULP mode, out frequency range is 24 - 50 MHz */
            /* For LP mode, out frequency range is 24 - 100 MHz */
            if (devConfig->ulpEnable)
            {
                if ((devConfig->fllOutFreqHz < CY_PRA_FLL_OUT_MIN_FREQUENCY) || (devConfig->fllOutFreqHz > CY_PRA_FLL_ULP_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM_FLL0;
                }
            }
            else
            {
                if ((devConfig->fllOutFreqHz < CY_PRA_FLL_OUT_MIN_FREQUENCY) || (devConfig->fllOutFreqHz > CY_PRA_FLL_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM_FLL0;
                }
            } /*usingULP*/

            /* Validate multiplier min="1" max="262143" */
            if ((devConfig->fllMult < CY_PRA_FLL_MIN_MULTIPLIER) || (devConfig->fllMult > CY_PRA_FLL_MAX_MULTIPLIER))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            /* Validate reference min="1" max="8191" */
            if ((devConfig->fllRefDiv < CY_PRA_FLL_MIN_REFDIV) || (devConfig->fllRefDiv > CY_PRA_FLL_MAX_REFDIV))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            /* ccoRange */
            if (devConfig->fllCcoRange > CY_SYSCLK_FLL_CCO_RANGE4)
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            /* lockTolerance min="0" max="511" */
            if (devConfig->lockTolerance > CY_PRA_FLL_MAX_LOCK_TOLERENCE)
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->igain > (SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Msk >> SRSS_CLK_FLL_CONFIG3_FLL_LF_IGAIN_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->pgain > (SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Msk >> SRSS_CLK_FLL_CONFIG3_FLL_LF_PGAIN_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->settlingCount > (SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT_Msk >> SRSS_CLK_FLL_CONFIG3_SETTLING_COUNT_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }
            if (devConfig->ccoFreq > (SRSS_CLK_FLL_CONFIG4_CCO_FREQ_Msk >> SRSS_CLK_FLL_CONFIG4_CCO_FREQ_Pos))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }

            /* Validate FLL output frequency */
            if ((devConfig->fllOutFreqHz) != Cy_PRA_CalculateFLLOutFreq(devConfig))
            {
                return CY_PRA_STATUS_INVALID_PARAM_FLL0;
            }

            return CY_PRA_STATUS_SUCCESS;
        }
        else
        {
            return CY_PRA_STATUS_INVALID_PARAM_FLL0;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidatePLL
****************************************************************************//**
*
* Validate Phase Locked Loop (PLL)
*
* \param devConfig System Configuration Parameter
* \param pll PLL number
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidatePLL(const cy_stc_pra_system_config_t *devConfig, uint8_t pll)
{
    uint32_t srcFreq, outFreq, minDesiredOutFreq;
    bool pllEnable, pathEnable, lowFreqMode;
    cy_en_clkpath_in_sources_t pathSrc;

    if ((pll == CY_PRA_DEFAULT_ZERO) || (pll > CY_SRSS_NUM_PLL))
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    if (pll == CY_PRA_CLKPLL_1)
    {
        pllEnable = devConfig->pll0Enable;
        pathEnable = devConfig->path1Enable;
        pathSrc = devConfig->path1Src;
        outFreq = devConfig->pll0OutFreqHz;
        lowFreqMode = devConfig->pll0LfMode;
    }
    else if (pll == CY_PRA_CLKPLL_2)
    {
        pllEnable = devConfig->pll1Enable;
        pathEnable = devConfig->path2Enable;
        pathSrc = devConfig->path2Src;
        outFreq = devConfig->pll1OutFreqHz;
        lowFreqMode = devConfig->pll1LfMode;
    }
    else
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    /* If PLL is sourced from ECO, WCO, ALTHF, EXTCLK, ILO, PILO clocks, then PLL output can't source
     * to HF0. This check is performed at HF0 validation */
    if (pllEnable)
    {
        if (pathEnable)
        {
            /* Source clock for PLL has valid range of 4 MHz - 64 MHz */
            srcFreq = Cy_PRA_GetInputPathMuxFrq(pathSrc, devConfig);
            if ((srcFreq < CY_PRA_PLL_SRC_MIN_FREQUENCY) || (srcFreq > CY_PRA_PLL_SRC_MAX_FREQUENCY))
            {
                return CY_PRA_STATUS_INVALID_PARAM;
            }

            /* If Low frequency mode is enabled then pll minimum output frequency is 10.625 MHz otherwise 12.5 MHz */
            (lowFreqMode) ? (minDesiredOutFreq = CY_PRA_PLL_LOW_OUT_MIN_FREQUENCY) : (minDesiredOutFreq = CY_PRA_PLL_OUT_MIN_FREQUENCY);
            /* For ULP mode, out frequency should not > 50 MHz */
            /* For LP mode, out frequency should not > CY_HF_CLK_MAX_FREQ */
            if (devConfig->ulpEnable)
            {
                if ((outFreq < minDesiredOutFreq) || (outFreq > CY_PRA_PLL_ULP_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM;
                }
            }
            else
            {
                if ((outFreq < minDesiredOutFreq) || (outFreq > CY_PRA_PLL_OUT_MAX_FREQUENCY))
                {
                    return CY_PRA_STATUS_INVALID_PARAM;
                }
            } /*usingULP*/

            /* Check PLL output frequency */
            if (outFreq != Cy_PRA_CalculatePLLOutFreq(pll, devConfig))
            {
                return CY_PRA_STATUS_INVALID_PARAM;
            }
        }
        else
        {
            return CY_PRA_STATUS_INVALID_PARAM;
        }
    }

