ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateAllPLL
****************************************************************************//**
*
* Validate All Phase Locked Loop (PLL)
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_PLL0 for bad parameter for PLL0
* CY_PRA_STATUS_INVALID_PARAM_PLL1 for bad parameter for PLL1
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateAllPLL(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;

    /* PLL0 is always sourced from PATH_MUX1 */
    if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (devConfig->pll0Enable))
    {
        if (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1))
        {
            retStatus = Cy_PRA_ValidatePLL(devConfig, CY_PRA_CLKPLL_1);
        }

        if (CY_PRA_STATUS_SUCCESS != retStatus)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_PLL0;
        }
    }
    /* PLL1 is always sourced from PATH_MUX2 */
    if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (devConfig->pll1Enable) && (retStatus == CY_PRA_STATUS_SUCCESS))
    {
        if (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2))
        {
            retStatus = Cy_PRA_ValidatePLL(devConfig, CY_PRA_CLKPLL_2);
        }

        if (CY_PRA_STATUS_SUCCESS != retStatus)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_PLL1;
        }
    }
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkLf
****************************************************************************//**
*
* Validate Low-Frequency Clock (CLK_LF)
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKLF for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkLf(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;

    /* output frequency = input frequency [range min="0" max="100000"] */
    if (devConfig->clkLFEnable)
    {
        switch (devConfig->clkLfSource)
        {
            case CY_SYSCLK_CLKLF_IN_ILO:
            {
                (devConfig->iloEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF);
            }
            break;
            case CY_SYSCLK_CLKLF_IN_WCO:
            {
                (devConfig->wcoEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF);
            }
            break;
            case CY_SYSCLK_CLKLF_IN_PILO:
            {
                ((devConfig->piloEnable) && (CY_SRSS_PILO_PRESENT)) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF);
            }
            break;
            default:
            {
                retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKLF;
            }
            break;
        } /* End of Switch */
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkPathMux
****************************************************************************//**
*
* Return error if specified path source is disabled.
*
* \param pathMuxSrc Source clock for the PATH_MUX
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkPathMux(cy_en_clkpath_in_sources_t pathSrc, const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t status;

    /* Check Source clock is enabled */
    switch (pathSrc)
    {
        case CY_SYSCLK_CLKPATH_IN_IMO:
        {
            status = CY_PRA_STATUS_SUCCESS;
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_EXT:
        {
            (devConfig->extClkEnable) ? (status = CY_PRA_STATUS_SUCCESS) : (status = CY_PRA_STATUS_INVALID_PARAM);
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ECO:
        {
            (devConfig->ecoEnable) ? (status = CY_PRA_STATUS_SUCCESS) : (status = CY_PRA_STATUS_INVALID_PARAM);
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ALTHF:
        {
            (devConfig->clkAltHfEnable) ? (status = CY_PRA_STATUS_SUCCESS) : (status = CY_PRA_STATUS_INVALID_PARAM);
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_ILO:
        {
            (devConfig->iloEnable) ? (status = CY_PRA_STATUS_SUCCESS) : (status = CY_PRA_STATUS_INVALID_PARAM);
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_WCO:
        {
            (devConfig->wcoEnable) ? (status = CY_PRA_STATUS_SUCCESS) : (status = CY_PRA_STATUS_INVALID_PARAM);
        }
        break;
        case CY_SYSCLK_CLKPATH_IN_PILO:
        {
            ((devConfig->piloEnable) && (CY_SRSS_PILO_PRESENT)) ? (status = CY_PRA_STATUS_SUCCESS) : (status = CY_PRA_STATUS_INVALID_PARAM);
        }
        break;
        default:
        {
            status = CY_PRA_STATUS_INVALID_PARAM;
        }
        break;
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkPath
****************************************************************************//**
*
* Validate Clock Path
*
* \param clkPath Clock path
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkPath(uint32_t clkPath, const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_INVALID_PARAM;
    if(clkPath >= CY_SRSS_NUM_CLKPATH)
    {
        return     retStatus;
    }

    switch (clkPath)
    {
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH0: /* CLK_PATH0 */
        {
            if (devConfig->path0Enable)
            {
                retStatus = Cy_PRA_ValidateClkPathMux(devConfig->path0Src, devConfig);
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH1: /* CLK_PATH1 */
        {
            if (devConfig->path1Enable)
            {
                retStatus = Cy_PRA_ValidateClkPathMux(devConfig->path1Src, devConfig);
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH2: /* CLK_PATH2 */
        {
            if (devConfig->path2Enable)
            {
                retStatus = Cy_PRA_ValidateClkPathMux(devConfig->path2Src, devConfig);
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH3: /* CLK_PATH3 */
        {
            if (devConfig->path3Enable)
            {
                retStatus = Cy_PRA_ValidateClkPathMux(devConfig->path3Src, devConfig);
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH4: /* CLK_PATH4 */
        {
            if (devConfig->path4Enable)
            {
                retStatus = Cy_PRA_ValidateClkPathMux(devConfig->path4Src, devConfig);
            }
        }
        break;
        case (uint32_t)CY_SYSCLK_CLKHF_IN_CLKPATH5: /* CLK_PATH5 */
        {
            if (devConfig->path5Enable)
            {
                retStatus = Cy_PRA_ValidateClkPathMux(devConfig->path5Src, devConfig);
            }
        }
        break;
        default:
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM;
        }
        break;
    }

