ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateAllClkPathMux
****************************************************************************//**
*
* Validate All PATH MUXes
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX0 for bad parameter for path-mux0
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX1 for bad parameter for path-mux1
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX2 for bad parameter for path-mux2
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX3 for bad parameter for path-mux3
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX4 for bad parameter for path-mux4
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX5 for bad parameter for path-mux5
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateAllClkPathMux(const cy_stc_pra_system_config_t *devConfig)
{

    if ((devConfig->path0Enable) && (CY_PRA_CLKPATH_0 < CY_SRSS_NUM_CLKPATH)) /* path_mux0 is enabled */
    {
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPathMux(devConfig->path0Src, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_PATHMUX0;
        }
    }
    if ((devConfig->path1Enable) && (CY_PRA_CLKPATH_1 < CY_SRSS_NUM_CLKPATH)) /* path_mux1 is enabled */
    {
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPathMux(devConfig->path1Src, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_PATHMUX1;
        }
    }
    if ((devConfig->path2Enable) && (CY_PRA_CLKPATH_2 < CY_SRSS_NUM_CLKPATH)) /* path_mux2 is enabled */
    {
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPathMux(devConfig->path2Src, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_PATHMUX2;
        }
    }
    if ((devConfig->path3Enable) && (CY_PRA_CLKPATH_3 < CY_SRSS_NUM_CLKPATH)) /* path_mux3 is enabled */
    {
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPathMux(devConfig->path3Src, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_PATHMUX3;
        }
    }
    if ((devConfig->path4Enable) && (CY_PRA_CLKPATH_4 < CY_SRSS_NUM_CLKPATH)) /* path_mux4 is enabled */
    {
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPathMux(devConfig->path4Src, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_PATHMUX4;
        }
    }
    if ((devConfig->path5Enable) && (CY_PRA_CLKPATH_5 < CY_SRSS_NUM_CLKPATH))/* path_mux5 is enabled */
    {
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPathMux(devConfig->path5Src, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_PATHMUX5;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkHfFreqDiv
****************************************************************************//**
*
* Validate High Frequency Clock's output frequency and divider
*
* \param outFreq Output frequency
* \param divider Frequency divider
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkHfFreqDiv(uint32_t outFreqMHz, cy_en_clkhf_dividers_t divider)
{
    /* min="1" max="CY_HF_CLK_MAX_FREQ" */
    if ((outFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION) > CY_HF_CLK_MAX_FREQ)
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }
    if (divider > CY_SYSCLK_CLKHF_DIVIDE_BY_8)
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkHFs
****************************************************************************//**
*
* Validate All High Frequency Clocks
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKHF0 for bad parameter for HF0
* CY_PRA_STATUS_INVALID_PARAM_CLKHF1 for bad parameter for HF1
* CY_PRA_STATUS_INVALID_PARAM_CLKHF2 for bad parameter for HF2
* CY_PRA_STATUS_INVALID_PARAM_CLKHF3 for bad parameter for HF3
* CY_PRA_STATUS_INVALID_PARAM_CLKHF4 for bad parameter for HF4
* CY_PRA_STATUS_INVALID_PARAM_CLKHF5 for bad parameter for HF5
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkHFs(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_clkpath_in_sources_t clkSource;
    cy_en_pra_status_t status;
    uint32_t freq;

    /* Validate HF0 */
    if ((devConfig->clkHF0Enable) && (CY_PRA_CLKHF_0 < CY_SRSS_NUM_HFROOT))
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t)(devConfig->hf0Source), devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }

        /* ECO, WCO, ALTHF, EXTCLK, ILO, PILO cannot act as source to HF0  */
        clkSource = Cy_PRA_GetInputSourceClock((uint32_t) devConfig->hf0Source, devConfig, &status);
        if ((clkSource != CY_SYSCLK_CLKPATH_IN_IMO) || (status != CY_PRA_STATUS_SUCCESS))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }

        /* HF0: input source can not be slower than legal min 200 kHz */
        status = Cy_PRA_GetInputSourceFreq((uint32_t) devConfig->hf0Source, devConfig, &freq);
        if ((freq < CY_PRA_HF0_MIN_FREQUENCY) || (status != CY_PRA_STATUS_SUCCESS))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }

        /* Validate Output frequency and Dvivider */
        if ((devConfig->hf0OutFreqMHz == 0UL) || (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf0OutFreqMHz, devConfig->hf0Divider)))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
        }
    }
    else
    {
        /* This can't be disabled */
        return CY_PRA_STATUS_INVALID_PARAM_CLKHF0;
    }

    /* Validate HF1 */
    if ((devConfig->clkHF1Enable) && (CY_PRA_CLKHF_1 < CY_SRSS_NUM_HFROOT))
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t)(devConfig->hf1Source), devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
        }
        /* Validate Output frequency and Dvivider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf1OutFreqMHz, devConfig->hf1Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
        }
    }

    /* Validate HF2 */
    if ((devConfig->clkHF2Enable) && (CY_PRA_CLKHF_2 < CY_SRSS_NUM_HFROOT))
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t)(devConfig->hf2Source), devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
        }

        /* Validate Output frequency and Dvivider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf2OutFreqMHz, devConfig->hf2Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
        }
    }

