ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    /* Validate HF3 */
    if ((devConfig->clkHF3Enable) && (CY_PRA_CLKHF_3 < CY_SRSS_NUM_HFROOT))
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->hf3Source, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
        }

        /* Validate Output frequency and Dvivider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf3OutFreqMHz, devConfig->hf3Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
        }
    }

    /* Validate HF4 */
    if ((devConfig->clkHF4Enable) && (CY_PRA_CLKHF_4 < CY_SRSS_NUM_HFROOT))
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->hf4Source, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
        }

        /* Validate Output frequency and Dvivider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf4OutFreqMHz, devConfig->hf4Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
        }
    }

    /* Validate HF5 */
    if ((devConfig->clkHF5Enable) && (CY_PRA_CLKHF_5 < CY_SRSS_NUM_HFROOT))
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->hf5Source, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
        }

        /* Validate Output frequency and Dvivider */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkHfFreqDiv(devConfig->hf5OutFreqMHz, devConfig->hf5Divider))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkPump
****************************************************************************//**
*
* Validate PUMP Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKPUMP for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkPump(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;
    cy_en_pra_status_t status = CY_PRA_STATUS_SUCCESS;
    /* Validate PUMP */
    if (devConfig->clkPumpEnable)
    {
        /* input source clock should be enabled */
        if (CY_PRA_STATUS_SUCCESS != Cy_PRA_ValidateClkPath((uint32_t) devConfig->pumpSource, devConfig))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
        }

        /* Validate Divider */
        if (devConfig->pumpDivider > CY_SYSCLK_PUMP_DIV_16)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
        }

        /* Output frequency range min="0" max="400000000" */
        status = Cy_PRA_GetInputSourceFreq((uint32_t) devConfig->pumpSource,devConfig, &freq);    
        if( status == CY_PRA_STATUS_SUCCESS )
        {
            freq = freq / (1UL << devConfig->pumpDivider); /* Calculate Output frequency */
            if (freq > CY_PRA_PUMP_OUT_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
            }
        }
        else
        {
            status = CY_PRA_STATUS_INVALID_PARAM_CLKPUMP;
        }
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkBak
****************************************************************************//**
*
* Validate Backup Domain Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKBAK for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkBak(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;
    uint32_t freq;

    if (devConfig->clkBakEnable)
    {
        /* Validate CLK_BAK source */
        switch (devConfig->clkBakSource)
        {
            case CY_SYSCLK_BAK_IN_WCO:
            {
                (devConfig->wcoEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK);
            }
            break;
            case CY_SYSCLK_BAK_IN_CLKLF:
            {
                (devConfig->clkLFEnable) ? (retStatus = CY_PRA_STATUS_SUCCESS) : (retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK);
            }
            break;
            default:
            {
                retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK;
            }
            break;
        }

        if (CY_PRA_STATUS_SUCCESS != retStatus)
        {
            return retStatus;
        }

        /* Validate Output Frequency min="0" max="100000" */
        /* There is no divider for CLK_BAK. So output frequency = input frequency */
        freq = Cy_PRA_GetClkBakFreq(devConfig);
        if (freq > CY_PRA_BAK_OUT_MAX_FREQUENCY)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_CLKBAK;
        }
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkFast
****************************************************************************//**
*
* Validate Fast Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKFAST for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkFast(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;

    /* source clock (HF0) must be enabled */
    if (devConfig->clkFastEnable)
    {
        if (!(devConfig->clkHF0Enable))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKFAST;
        }

        /* Validate frequency range. min="0" max="400000000" */
        freq = devConfig->hf0OutFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION; /* input frequency */
        freq = freq / (devConfig->clkFastDiv+1UL); /* Calculate Output frequency */
        if (freq > CY_PRA_FAST_OUT_MAX_FREQUENCY)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKFAST;
        }

