ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
        /* Validate divider min="1" max="256". User has to pass actual divider-1 */
        /* No need to validate divider because max value input can not be more that 255 */
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkPeri
****************************************************************************//**
*
* Validate Peripheral Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKPERI for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkPeri(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;

    /* source clock (HF0) must be enabled */
    if (devConfig->clkPeriEnable)
    {
        if (!(devConfig->clkHF0Enable))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
        }

        freq = devConfig->hf0OutFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION; /* input frequency */
        if (freq > CY_HF_CLK_MAX_FREQ)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
        }

        freq = freq / (devConfig->clkPeriDiv+1UL); /* Calculate Output frequency */

        /* Maximum of 25 MHz when the ULP mode is used and 100 MHz for LP mode */
        if (devConfig->ulpEnable)
        {
            if (freq > CY_PRA_ULP_MODE_HF0_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
            }
        }
        else
        {
            if (freq > CY_PRA_LP_MODE_MAX_FREQUENCY)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
            }
        }

        /* Validate divider min="1" max="256". User has to pass actual divider-1 */
        /* No need to validate divider because max value input can not be more that 255 */
    }
    else
    {
        /* check if this clock can't be disabled */
        return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkTimer
****************************************************************************//**
*
* Validate Timer Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkTimer(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;
    uint8_t srcDiv;

    /* source clock must be enabled */
    if (devConfig->clkTimerEnable)
    {
        switch (devConfig->clkTimerSource)
        {
            case CY_SYSCLK_CLKTIMER_IN_IMO:
            {
                /* IMO is always on */
                freq = CY_PRA_IMO_SRC_FREQUENCY; /* 8 MHz */
                srcDiv = CY_PRA_DIVIDER_1;
            }
            break;
            case CY_SYSCLK_CLKTIMER_IN_HF0_NODIV:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV2:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV4:
            case CY_SYSCLK_CLKTIMER_IN_HF0_DIV8:
            {
                if ( devConfig->clkHF0Enable )
                {
                    srcDiv = CY_PRA_DIVIDER_1;
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV2)
                    {
                        srcDiv = CY_PRA_DIVIDER_2;
                    }
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV4)
                    {
                        srcDiv = CY_PRA_DIVIDER_4;
                    }
                    if (devConfig->clkTimerSource == CY_SYSCLK_CLKTIMER_IN_HF0_DIV8)
                    {
                        srcDiv = CY_PRA_DIVIDER_8;
                    }
                    freq = devConfig->hf0OutFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION;
                }
                else
                {
                    return CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
                }
            }
            break;
            default:
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
            }
        }

        freq = (freq / (devConfig->clkTimerDivider + 1UL)) / srcDiv;
        /* Output frequency range min="0" max="400000000" */
        if (freq > CY_PRA_TIMER_OUT_MAX_FREQUENCY)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKTIMER;
        }
    }

    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkSlow
****************************************************************************//**
*
* Validate Slow Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM_CLKPERI for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkSlow(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t freq;

    /* source clock must be enabled */
    if (devConfig->clkSlowEnable)
    {
        if (!(devConfig->clkPeriEnable))
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKSLOW;
        }

        /* outFreq = (sourceFreq / divider) range is min="0" max="400000000" */
        freq = devConfig->hf0OutFreqMHz*CY_PRA_FREQUENCY_HZ_CONVERSION; /* input frequency */
        if (freq > CY_HF_CLK_MAX_FREQ)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKPERI;
        }

        freq = freq / (devConfig->clkPeriDiv+1UL); /* Calculate Output frequency for PERI and Input Freq for SLOW_CLK */

        freq = freq / (devConfig->clkSlowDiv+1UL); /* Output CLK_SLOW frequency */

        if (freq > CY_PRA_SLOW_OUT_MAX_FREQUENCY)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKSLOW;
        }
    }
    else
    {
        /* check if this clock is always on */
        return CY_PRA_STATUS_INVALID_PARAM_CLKSLOW;
    }

