ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    return CY_PRA_STATUS_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateClkAltSysTick
****************************************************************************//**
*
* Validate Alt Sys Tick Clock
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM for bad parameter
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateClkAltSysTick(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t retStatus = CY_PRA_STATUS_SUCCESS;
    uint32_t freq;

    /* source clock must be enabled */
    if (devConfig->clkAltSysTickEnable)
    {
        switch (devConfig->clkSrcAltSysTick)
        {
            case CY_SYSTICK_CLOCK_SOURCE_CLK_LF:
            {
                if (devConfig->clkLFEnable)
                {
                    freq = Cy_PRA_GetClkLfFreq(devConfig);
                    retStatus = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    retStatus = CY_PRA_STATUS_INVALID_PARAM_SYSTICK;
                }
            }
            break;
            case CY_SYSTICK_CLOCK_SOURCE_CLK_IMO:
            {
                freq = CY_PRA_IMO_SRC_FREQUENCY;
                retStatus = CY_PRA_STATUS_SUCCESS;
            }
            break;
            case CY_SYSTICK_CLOCK_SOURCE_CLK_ECO:
            {
                /* ECO is disabled for secure device */
                retStatus = CY_PRA_STATUS_INVALID_PARAM_SYSTICK;
            }
            break;
            case CY_SYSTICK_CLOCK_SOURCE_CLK_TIMER:
            {
                if (devConfig->clkTimerEnable)
                {
                    freq = Cy_PRA_GetClkTimerFreq(devConfig);
                    retStatus = CY_PRA_STATUS_SUCCESS;
                }
                else
                {
                    retStatus = CY_PRA_STATUS_INVALID_PARAM_SYSTICK;
                }
            }
            break;
            default:
            {
                retStatus = CY_PRA_STATUS_INVALID_PARAM_SYSTICK;
            }
            break;
        } /* switch */

        if (retStatus != CY_PRA_STATUS_SUCCESS)
        {
            return retStatus;
        }

        /* output frequency range min="0" max="400000000" */
        /* There is no divider for Timer so, output frequency = input frequency */
        if (freq > CY_PRA_SYSTICK_OUT_MAX_FREQUENCY)
        {
            retStatus = CY_PRA_STATUS_INVALID_PARAM_SYSTICK;
        }
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: Cy_PRA_ValidateSystemConfig
****************************************************************************//**
*
* Validate System Configuration
*
* \param devConfig System Configuration Parameter
*
* \return
* CY_PRA_STATUS_SUCCESS for valid input configuration
* CY_PRA_STATUS_INVALID_PARAM generic failure in validation
* CY_PRA_STATUS_INVALID_PARAM_ECO Error in ECO validation
* CY_PRA_STATUS_INVALID_PARAM_EXTCLK Error in EXTCLK validation
* CY_PRA_STATUS_INVALID_PARAM_ALTHF Error in ALTHF validation
* CY_PRA_STATUS_INVALID_PARAM_ILO Error in ILO validation
* CY_PRA_STATUS_INVALID_PARAM_PILO Error in PILO validation
* CY_PRA_STATUS_INVALID_PARAM_WCO Error in WCO validation
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX0 Error in PATHMUX0 validation
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX1 Error in PATHMUX1 validation
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX2 Error in PATHMUX2 validation
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX3 Error in PATHMUX3 validation
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX4 Error in PATHMUX4 validation
* CY_PRA_STATUS_INVALID_PARAM_PATHMUX5 Error in PATHMUX5 validation
* CY_PRA_STATUS_INVALID_PARAM_FLL0 Error in FLL validation
* CY_PRA_STATUS_INVALID_PARAM_PLL0 Error in PLL0 validation
* CY_PRA_STATUS_INVALID_PARAM_PLL1 Error in PLL1 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKLF Error in CLKLF validation
* CY_PRA_STATUS_INVALID_PARAM_CLKHF0 Error in CLKHF0 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKHF1 Error in CLKHF1 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKHF2 Error in CLKHF2 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKHF3 Error in CLKHF3 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKHF4 Error in CLKHF4 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKHF5 Error in CLKHF5 validation
* CY_PRA_STATUS_INVALID_PARAM_CLKPUMP Error in CLKPUMP validation
* CY_PRA_STATUS_INVALID_PARAM_CLKBAK Error in CLKBAK validation
* CY_PRA_STATUS_INVALID_PARAM_CLKFAST Error in CLKFAST validation
* CY_PRA_STATUS_INVALID_PARAM_CLKPERI Error in CLKPERI validation
* CY_PRA_STATUS_INVALID_PARAM_CLKSLOW Error in CLKSLOW validation
* CY_PRA_STATUS_INVALID_PARAM_SYSTICK Error in CLKTICK validation
* CY_PRA_STATUS_INVALID_PARAM_CLKTIMER Error in CLKTIMER validation
*
*******************************************************************************/
static cy_en_pra_status_t Cy_PRA_ValidateSystemConfig(const cy_stc_pra_system_config_t *devConfig)
{

     cy_en_pra_status_t retStatus;

    if (devConfig == NULL )
    {
        return CY_PRA_STATUS_INVALID_PARAM;
    }

    /* Validate IMO */
    /* IMO must be enabled for proper chip operation. So user option is not given for IMO.
     * The output frequency of IMO is fixed to 8MHz.
     */

     /* Validate ECO */
    retStatus = Cy_PRA_ValidateECO(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate EXTCLK */
    retStatus = Cy_PRA_ValidateEXTClk(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate ALTHF (BLE ECO) */
#if defined(CY_IP_MXBLESS)
    retStatus = Cy_PRA_ValidateAltHf(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }
#endif

    /* Validate ILO */
    /* ILO frequency fixed to 32KHz */

