ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    /* Validate PILO */
    /* PILO frequency is fixed to 32.768KHz */

    /* Validate WCO */
    /* WCO frequency is fixed to 32.768KHz */

    /* Validate Path Mux */
    retStatus = Cy_PRA_ValidateAllClkPathMux(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate FLL */
    /* For ULP mode, Ffll_max = 50 MHz. For LP mode, Ffll_max = 100 MHz or Fcpu_max (if Fcpu_max < 100 MHz) */
    retStatus = Cy_PRA_ValidateFLL(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate PLLs */
    retStatus = Cy_PRA_ValidateAllPLL(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_LF */
    retStatus = Cy_PRA_ValidateClkLf(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_HF */
    retStatus = Cy_PRA_ValidateClkHFs(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_PUMP */
    retStatus = Cy_PRA_ValidateClkPump(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_BAK */
    retStatus = Cy_PRA_ValidateClkBak(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_FAST */
    retStatus = Cy_PRA_ValidateClkFast(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_PERI */
    retStatus = Cy_PRA_ValidateClkPeri(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_TIMER */
    retStatus = Cy_PRA_ValidateClkTimer(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_SLOW */
    retStatus = Cy_PRA_ValidateClkSlow(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

    /* Validate CLK_ALT_SYS_TICK */
    retStatus = Cy_PRA_ValidateClkAltSysTick(devConfig);
    if (CY_PRA_STATUS_SUCCESS != retStatus)
    {
        return retStatus;
    }

     return CY_PRA_STATUS_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_PRA_CalculateFLLOutFreq
****************************************************************************//**
*
* Calculate and return FLL output frequency
*
* \param devConfig
*
* \return
* FLL output frequency
*
*******************************************************************************/
uint32_t Cy_PRA_CalculateFLLOutFreq(const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq;
    uint32_t outFreq=0UL;

    srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path0Src, devConfig);
    if ((srcFreq != CY_PRA_DEFAULT_SRC_FREQUENCY) && (devConfig->fllRefDiv != 0UL))
    {
        outFreq = ((srcFreq * devConfig->fllMult) / devConfig->fllRefDiv) / (devConfig->enableOutputDiv ? 2UL : 1UL);
    }

    return outFreq;
}

/*******************************************************************************
* Function Name: Cy_PRA_CalculatePLLOutFreq
****************************************************************************//**
*
* Calculate and return PLL output frequency
*
* \param devConfig
*
* \return
* PLL output frequency
*
*******************************************************************************/
uint32_t Cy_PRA_CalculatePLLOutFreq(uint8_t pll, const cy_stc_pra_system_config_t *devConfig)
{
    uint32_t srcFreq;
    uint32_t outFreq;
    uint32_t feedback;
    uint32_t reference;
    uint32_t pllOutputDiv;

    if ((pll > CY_PRA_DEFAULT_ZERO) && (pll <= CY_SRSS_NUM_PLL)) /* 0 is invalid pll number */
    {
        if (pll == CY_PRA_CLKPLL_1)
        {
            srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path1Src, devConfig);
            feedback = devConfig->pll0FeedbackDiv;
            reference = devConfig->pll0ReferenceDiv;
            pllOutputDiv = devConfig->pll0OutputDiv;
        }
        else if (pll == CY_PRA_CLKPLL_2)
        {
            srcFreq = Cy_PRA_GetInputPathMuxFrq(devConfig->path2Src, devConfig);
            feedback = devConfig->pll1FeedbackDiv;
            reference = devConfig->pll1ReferenceDiv;
            pllOutputDiv = devConfig->pll1OutputDiv;
        }
        else
        {
            srcFreq = CY_PRA_DEFAULT_SRC_FREQUENCY;
        }

        if ((srcFreq != CY_PRA_DEFAULT_SRC_FREQUENCY) && (reference != CY_PRA_DIVIDER_0) && (pllOutputDiv != CY_PRA_DIVIDER_0))
        {
            outFreq = ((srcFreq * feedback) / reference) / pllOutputDiv;
        }
        else
        {
            outFreq = CY_PRA_DEFAULT_ZERO;
        }
    }
    else
    {
        outFreq = CY_PRA_DEFAULT_ZERO;
    }

    return outFreq;
}

#endif /* (CY_CPU_CORTEX_M0P) */


/*******************************************************************************
* Function Name: Cy_PRA_SystemConfig
****************************************************************************//**
*
* Initializes and Configure Device
*
* \param devConfig
*
* \return
* Status of the function processing.
*
*******************************************************************************/
cy_en_pra_status_t Cy_PRA_SystemConfig(const cy_stc_pra_system_config_t *devConfig)
{
    cy_en_pra_status_t status;

#if (CY_CPU_CORTEX_M4)
    (void) devConfig;
    status = CY_PRA_STATUS_SUCCESS;
#else

    cy_en_sysclk_status_t sysClkStatus;
    bool tmp, tmp1, tmp2;


    /* Validate input parameters */
    status = Cy_PRA_ValidateSystemConfig(devConfig);
    if (CY_PRA_STATUS_SUCCESS != status)
    {
        return status;
    }

    /* Set worst case memory wait states (! ultra low power, 150 MHz), will update at the end */
    Cy_SysLib_SetWaitStates(false, CY_PRA_150MHZ_FREQUENCY);
    if (devConfig->powerEnable)
    {
        status = Cy_PRA_PowerInit(devConfig);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

