ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    /* Reset the core clock path to default and disable all the FLLs/PLLs */
    sysClkStatus = Cy_SysClk_ClkHfSetDivider(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_NO_DIVIDE);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }


    tmp = Cy_SysClk_FllIsEnabled();
    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1)
    {
        tmp1 = Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1);
    }
    if (CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2)
    {
        tmp2 = Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2);
    }
    if ((tmp  != (devConfig->fllEnable))  ||
        ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (tmp1 != (devConfig->pll0Enable))) ||
        ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (tmp2 != (devConfig->pll1Enable))))
    {
        Cy_SysClk_ClkFastSetDivider(CY_PRA_DIVIDER_0);
        Cy_SysClk_ClkPeriSetDivider(CY_PRA_DIVIDER_1);
        Cy_SysClk_ClkSlowSetDivider(CY_PRA_DIVIDER_0);

        if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (!devConfig->pll0Enable))
        {
            SystemCoreClockUpdate();
            sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_1);
        }

        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
        }

        if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (!devConfig->pll1Enable))
        {
            SystemCoreClockUpdate();
            sysClkStatus = Cy_SysClk_PllDisable(CY_PRA_CLKPLL_2);
        }

        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
        }

        sysClkStatus = Cy_SysClk_ClkPathSetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH1, CY_SYSCLK_CLKPATH_IN_IMO);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }

        if (CY_SYSCLK_CLKHF_IN_CLKPATH0 == Cy_SysClk_ClkHfGetSource(CY_PRA_CLKHF_0))
        {
                if (CY_SYSCLK_CLKPATH_IN_WCO == Cy_SysClk_ClkPathGetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH0))
                {
                            sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH1);
                            if (CY_SYSCLK_SUCCESS != sysClkStatus)
                            {
                                        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
                            }
                }
        }

        if (!devConfig->fllEnable)
        {
            sysClkStatus = Cy_SysClk_FllDisable();
        }
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_FLL0;
        }

        sysClkStatus = Cy_SysClk_ClkPathSetSource((uint32_t) CY_SYSCLK_CLKHF_IN_CLKPATH0, CY_SYSCLK_CLKPATH_IN_IMO);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX0;
        }

        sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH0);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
        }
    }

#ifdef CY_IP_MXBLESS
    Cy_PRA_AltHfReset(devConfig);
#endif

    if(CY_SRSS_PILO_PRESENT)
    {
        /* Enable all source clocks */
        if (devConfig->piloEnable)
        {
            SystemCoreClockUpdate();
            Cy_PRA_PiloInit();
        }
        else
        {
            Cy_SysClk_PiloDisable();
        }
    }

    if (devConfig->wcoEnable)
    {
        SystemCoreClockUpdate();
        status = Cy_PRA_WcoInit(devConfig);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }
    else
    {
        Cy_SysClk_WcoDisable();
    }

    if (devConfig->clkLFEnable)
    {
        status = Cy_PRA_ClkLfInit(devConfig->clkLfSource);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }
#if defined(CY_IP_MXBLESS)
    if (devConfig->clkAltHfEnable)
    {
        SystemCoreClockUpdate();
        status = Cy_PRA_AltHfInit(devConfig);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }
#endif /* CY_IP_MXBLESS */
    tmp = (CY_SYSCLK_ECOSTAT_STABLE == Cy_SysClk_EcoGetStatus());
    if (tmp != (devConfig->ecoEnable))
    {
        if (devConfig->ecoEnable)
        {
            SystemCoreClockUpdate();
            status = Cy_PRA_EcoInit(devConfig);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return status;
            }
        }
        else
        {
            Cy_SysClk_EcoDisable();
        }
    }

    if (devConfig->extClkEnable)
    {
        Cy_PRA_ExtClkInit(devConfig);
    }

    if (devConfig->clkFastEnable)
    {
        Cy_SysClk_ClkFastSetDivider(devConfig->clkFastDiv);
    }

    if (devConfig->clkPeriEnable)
    {
        Cy_SysClk_ClkPeriSetDivider(devConfig->clkPeriDiv);
    }

    if (devConfig->clkSlowEnable)
    {
        Cy_SysClk_ClkSlowSetDivider(devConfig->clkSlowDiv);
    }

    if ((devConfig->path0Src == CY_SYSCLK_CLKPATH_IN_WCO) &&
        (devConfig->hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH0))
    {
        /* Configure HFCLK0 to temporarily run from IMO to initialize other clocks */
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, CY_SYSCLK_CLKPATH_IN_IMO);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }
        sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, CY_SYSCLK_CLKHF_IN_CLKPATH1);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
        }
    }
    else
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, devConfig->path1Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }
    }

    /* Configure Path Clocks */

    if (devConfig->path0Enable)
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_0, devConfig->path0Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX0;
        }
    }

