ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
    if (devConfig->path2Enable)
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_2, devConfig->path2Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX2;
        }
    }

    if ((devConfig->path3Enable) && (CY_PRA_CLKPATH_3 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_3, devConfig->path3Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus) 
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX3;
        }
    }

    if ((devConfig->path4Enable) && (CY_PRA_CLKPATH_4 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_4, devConfig->path4Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus) 
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX4;
        }
    }

    if ((devConfig->path5Enable) && (CY_PRA_CLKPATH_5 < CY_SRSS_NUM_CLKPATH))
    {
        sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_5, devConfig->path5Src);
        if (CY_SYSCLK_SUCCESS != sysClkStatus)
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX5;
        }
    }

    if ((!Cy_SysClk_FllIsEnabled()) && (devConfig->fllEnable))
    {
        SystemCoreClockUpdate();
        status = Cy_PRA_FllInit(devConfig);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

    /* ClkHf0Init */
    sysClkStatus = Cy_SysClk_ClkHfSetSource(CY_PRA_CLKHF_0, devConfig->hf0Source);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }
    sysClkStatus = Cy_SysClk_ClkHfSetDivider(CY_PRA_CLKHF_0, devConfig->hf0Divider);
    if (CY_SYSCLK_SUCCESS != sysClkStatus)
    {
        return CY_PRA_STATUS_ERROR_PROCESSING_CLKHF0;
    }

    if ((devConfig->path0Src == CY_SYSCLK_CLKPATH_IN_WCO) && (devConfig->hf0Source == CY_SYSCLK_CLKHF_IN_CLKPATH0))
    {
        if (devConfig->path1Enable)
        {
            sysClkStatus = Cy_SysClk_ClkPathSetSource(CY_PRA_CLKPATH_1, devConfig->path1Src);
            if (CY_SYSCLK_SUCCESS != sysClkStatus)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
            }
        }
        else
        {
            return CY_PRA_STATUS_ERROR_PROCESSING_PATHMUX1;
        }

    }

    if ((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_1) && (devConfig->pll0Enable))
    {
        if (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_1))
        {
            const cy_stc_pll_manual_config_t pll0Config =
            {
                .feedbackDiv = devConfig->pll0FeedbackDiv,
                .referenceDiv = devConfig->pll0ReferenceDiv,
                .outputDiv = devConfig->pll0OutputDiv,
                .lfMode = devConfig->pll0LfMode,
                .outputMode = devConfig->pll0OutputMode,
            };

            SystemCoreClockUpdate();
            status = Cy_PRA_PllInit(CY_PRA_CLKPLL_1, &pll0Config);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PLL0;
            }
        }
    }

    if((CY_SRSS_NUM_PLL >= CY_PRA_CLKPLL_2) && (devConfig->pll1Enable))
    {
        if (!Cy_SysClk_PllIsEnabled(CY_PRA_CLKPLL_2))
        {
            const cy_stc_pll_manual_config_t pll1Config =
            {
                .feedbackDiv = devConfig->pll1FeedbackDiv,
                .referenceDiv = devConfig->pll1ReferenceDiv,
                .outputDiv = devConfig->pll1OutputDiv,
                .lfMode = devConfig->pll1LfMode,
                .outputMode = devConfig->pll1OutputMode,
            };

            SystemCoreClockUpdate();
            status = Cy_PRA_PllInit(CY_PRA_CLKPLL_2, &pll1Config);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_ERROR_PROCESSING_PLL1;
            }
        }
    }

    /* Configure HF clocks */
    if (devConfig->clkHF1Enable)
    {
        status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_1, devConfig->hf1Source, devConfig->hf1Divider);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
        }
    }
    else
    {
        status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_1);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF1;
        }
    }
    if (devConfig->clkHF2Enable)
    {
        status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_2, devConfig->hf2Source, devConfig->hf2Divider);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
        }
    }
    else
    {
        status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_2);
        if (CY_PRA_STATUS_SUCCESS != status) 
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF2;
        }

    }
    if ((devConfig->clkHF3Enable) && (CY_PRA_CLKHF_3 < CY_SRSS_NUM_HFROOT))
    {
        status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_3, devConfig->hf3Source, devConfig->hf3Divider);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
        }
    }
    else
    {
        if (CY_PRA_CLKHF_3 < CY_SRSS_NUM_HFROOT)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_3);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF3;
            }
        }

    }
    if ((devConfig->clkHF4Enable) && (CY_PRA_CLKHF_4 < CY_SRSS_NUM_HFROOT))
    {
        status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_4, devConfig->hf4Source, devConfig->hf4Divider);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
        }
    }
    else
    {
        if(CY_PRA_CLKHF_4 < CY_SRSS_NUM_HFROOT)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_4);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF4;
            }
        }
    }
    if ((devConfig->clkHF5Enable) && (CY_PRA_CLKHF_5 < CY_SRSS_NUM_HFROOT))
    {
        status = Cy_PRA_ClkHfInit(CY_PRA_CLKHF_5, devConfig->hf5Source, devConfig->hf5Divider);
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
        }
    }
    else
    {
        if(CY_PRA_CLKHF_5 < CY_SRSS_NUM_HFROOT)
        {
            status = (cy_en_pra_status_t)Cy_SysClk_ClkHfDisable(CY_PRA_CLKHF_5);
            if (CY_PRA_STATUS_SUCCESS != status)
            {
                return CY_PRA_STATUS_INVALID_PARAM_CLKHF5;
            }
        }
    }
    /* Configure miscellaneous clocks */
    if (devConfig->clkTimerEnable)
    {
        Cy_PRA_ClkTimerInit(devConfig->clkTimerSource, devConfig->clkTimerDivider);
    }
    else
    {
         Cy_SysClk_ClkTimerDisable();
    }

    if (devConfig->clkAltSysTickEnable)
    {
        Cy_SysTick_SetClockSource(devConfig->clkSrcAltSysTick);
    }

    if (devConfig->clkPumpEnable)
    {
        Cy_PRA_ClkPumpInit(devConfig->pumpSource, devConfig->pumpDivider);
    }
    else
    {
        Cy_SysClk_ClkPumpDisable();
    }

    if (devConfig->clkBakEnable)
    {
        Cy_SysClk_ClkBakSetSource(devConfig->clkBakSource);
    }

    status = Cy_PRA_IloHibernateOn(devConfig->iloHibernateON);
    if (CY_PRA_STATUS_SUCCESS != status)
    {
        return status;
    }

    /* Configure default enabled clocks */
    if (devConfig->iloEnable)
    {
        status = Cy_PRA_IloEnable();
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }
    else
    {
        status = Cy_PRA_IloDisable();
        if (CY_PRA_STATUS_SUCCESS != status)
        {
            return status;
        }
    }

    /* SYSCLK MFO INIT */
    /* SYSCLK MF INIT */

    /* Set accurate flash wait states */
    if ((devConfig->powerEnable) && (devConfig->clkHF0Enable))
    {
        Cy_SysLib_SetWaitStates(devConfig->ulpEnable, devConfig->hf0OutFreqMHz);
    }

    /* Update System Core Clock values for correct Cy_SysLib_Delay functioning */
    SystemCoreClockUpdate();

