ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra_cfg.c
#endif /* (CY_CPU_CORTEX_M4) */

    return (status);
}


#if (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN)

    #if !defined(CY_DEVICE_PSOC6ABLE2)
        #define CY_PRA_ALL_PC_MASK      (CY_PROT_PCMASK1 + CY_PROT_PCMASK2 + \
                                        CY_PROT_PCMASK3 + CY_PROT_PCMASK4 + \
                                        CY_PROT_PCMASK5 + CY_PROT_PCMASK6 + \
                                        CY_PROT_PCMASK7)

        #define CY_PRA_SECURE_PC_MASK   (CY_PROT_PCMASK1 + CY_PROT_PCMASK2 + \
                                        CY_PROT_PCMASK3 + CY_PROT_PCMASK4)
    #endif /* !defined(CY_DEVICE_PSOC6ABLE2) */


/*******************************************************************************
* Function Name: Cy_PRA_CloseSrssMain2
****************************************************************************//**
*
* Restricts access to the SRSS_MAIN2 region that includes following register:
* SRSS_TST_DDFT_FAST_CTL_REG, SRSS_TST_DDFT_FAST_CTL_REG.
*
*******************************************************************************/
void Cy_PRA_CloseSrssMain2(void)
{
    #if defined(CY_DEVICE_PSOC6ABLE2)
        /* Will be Implemented for BLE device as per DRIVERS-3084 */
    #else
        (void) Cy_Prot_ConfigPpuFixedSlaveAtt(PERI_MS_PPU_FX_SRSS_MAIN2,
                                    (uint16_t) CY_PRA_SECURE_PC_MASK,
                                    CY_PROT_PERM_RW,
                                    CY_PROT_PERM_RW,
                                    false);

        (void) Cy_Prot_ConfigPpuFixedSlaveAtt(PERI_MS_PPU_FX_SRSS_MAIN2,
                                    (uint16_t) (CY_PRA_ALL_PC_MASK ^ CY_PRA_SECURE_PC_MASK),
                                    CY_PROT_PERM_DISABLED,
                                    CY_PROT_PERM_DISABLED,
                                    false);
    #endif /* defined(CY_DEVICE_PSOC6ABLE2) */
}


/*******************************************************************************
* Function Name: Cy_PRA_OpenSrssMain2
****************************************************************************//**
*
* Restores access to the SRSS_MAIN2 region that was restrcited by
* \ref Cy_PRA_CloseSrssMain2.
*
*******************************************************************************/
void Cy_PRA_OpenSrssMain2(void)
{
    #if defined(CY_DEVICE_PSOC6ABLE2)
        /* Will be Implemented for BLE device as per DRIVERS-3084 */
    #else
        (void) Cy_Prot_ConfigPpuFixedSlaveAtt(PERI_MS_PPU_FX_SRSS_MAIN2,
                                    (uint16_t) CY_PRA_ALL_PC_MASK,
                                    CY_PROT_PERM_RW,
                                    CY_PROT_PERM_RW,
                                    false);
    #endif /* defined(CY_DEVICE_PSOC6ABLE2) */
}

#endif /* (CY_CPU_CORTEX_M0P) */


#endif /* (CY_DEVICE_SECURE) */


/* [] END OF FILE */
